OpenFOAM/montana-v2106/run/mhdFoam/EIHMHD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L0 1;   // 1 meter

PL  #calc"2 * M_PI * $L0" ; // 2 pi l0, 

grid    400; //3072;

vertices
(
    /*
    (-0.4 -0.1 -1)
    (0.4 -0.1 -1)
    (0.4 0.1 -1)
    (-0.4 0.1 -1)
    (-0.4 -0.1 1)
    (0.4 -0.1 1)
    (0.4 0.1 1)
    (-0.4 0.1 1)
    */

    (-$PL -$PL -1) //
    ($PL -$PL -1)
    ($PL $PL -1)
    (-$PL $PL -1)
    (-$PL -$PL 1)
    ($PL -$PL 1)
    ($PL $PL 1)
    (-$PL $PL 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($grid $grid 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    top
    {
        type cyclic;
        neighbourPatch bottom;
        faces 
        (
            (6 2 3 7)
        );
    }

    bottom
    {
        type cyclic;
        neighbourPatch top;

        faces
        (
            (5 4 0 1)
        );
    }

    left
    {
        type cyclic;
	neighbourPatch right;
	//type	patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
    	type cyclic;
	neighbourPatch left;
	//type	patch;
        faces
        (
            (1 2 6 5)
            
        );
    }
    empty
    {
        type empty;
        faces
        (
            //(0 1 5 4)
            (5 6 7 4)
            //(3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
