OpenFOAM/montana-v2106/run/mhdFoam/EIHMHD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       319200;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom;
    }
    bottom
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       319600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       320000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       320400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320000;
        startFace       320800;
    }
)

// ************************************************************************* //
