OpenFOAM/montana-v2106/run/mhdFoam/EIHMHD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volVectorFieldValue U (0 0 0) volVectorFieldValue B (0.75 -1.0 0) volScalarFieldValue p 0.8 ); //right side

regions         ( boxToCell { box (-0.5 -1 -1) (0.0 1 1) ; fieldValues ( volScalarFieldValue p 1 volVectorFieldValue B (0.75 1 0)  ) ; } );//left side


// ************************************************************************* //
